Revit 2026 API

# RebarCrankOverridableParameters Properties

---

The RebarCrankOverridableParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarCrankOverridableParameters Class

Autodesk.Revit.DB.Structure Namespace